Revit 2026 API
LinearArray.Create Method
Overload List
Name | Description
Create(Document, View, ElementId, Int32, XYZ, ArrayAnchorMember) |  Creates a new linear array element from a single element.
Create(Document, View, ICollection<ElementId>, Int32, XYZ, ArrayAnchorMember)
Top
See Also
Reference
LinearArray Class
Autodesk.Revit.DB Namespace